/* В игре 2 кубика и на каждом из них может выпасть от 1 до 6 очков.
 * Реализовать определение программой первого ходящего. Каждый делает по четыре броска.  После бросков показать, нарисованные символами кубики и
 * количество очков, выпавших на них. После  пары бросков (бросок компьютера + бросок пользователя) выводить на экран промежуточный результат  –
 * количество набранных очков игроком и компьютером.  В конце сообщить о том, кто выиграл по итогам всех бросков.*/
#include <stdio.h>
#include <iostream>
#include <string.h>
#include <clocale>
#include <ctime>
#include <unistd.h>

using namespace std;


int chel;
int sum_user = 0;
int sum_PC = 0;


void move()
{
    int ch;
    ch = rand() % 2;
    chel = rand() % 6 + 1;
    if(chel == 1) {
        cout << "\t _____________________________\n"
                "\t|                             |\n"
                "\t|                             |\n"
                "\t|                             |\n"
                "\t|           ________          |\n"
                "\t|          |        |         |\n"
                "\t|          |        |         |  - 1\n"
                "\t|          |        |         |\n"
                "\t|          |________|         |\n"
                "\t|                             |\n"
                "\t|                             |\n"
                "\t|                             |\n"
                "\t|_____________________________|\n\n";
    }
    else if(chel == 2) {
        if(ch == 0) {
            cout << "\t _____________________________\n"
                    "\t|  ______                     |\n"
                    "\t| |      |                    |\n"
                    "\t| |      |                    |\n"
                    "\t| |______|                    |\n"
                    "\t|                             |\n"
                    "\t|                             |  - 2\n"
                    "\t|                             |\n"
                    "\t|                     ______  |\n"
                    "\t|                    |      | |\n"
                    "\t|                    |      | |\n"
                    "\t|                    |______| |\n"
                    "\t|_____________________________|\n\n";
        }
        else {
            cout << "\t _____________________________\n"
                    "\t|                     ______  |\n"
                    "\t|                    |      | |\n"
                    "\t|                    |      | |\n"
                    "\t|                    |______| |\n"
                    "\t|                             |\n"
                    "\t|                             |  - 2\n"
                    "\t|                             |\n"
                    "\t|  ______                     |\n"
                    "\t| |      |                    |\n"
                    "\t| |      |                    |\n"
                    "\t| |______|                    |\n"
                    "\t|_____________________________|\n\n";
        }
    }
    else if(chel == 3) {
        if(ch == 0) {
            cout << "\t _____________________________\n"
                    "\t|  ______                     |\n"
                    "\t| |      |                    |\n"
                    "\t| |      |                    |\n"
                    "\t| |______|                    |\n"
                    "\t|           ______            |\n"
                    "\t|          |      |           |  - 3\n"
                    "\t|          |      |           |\n"
                    "\t|          |______|   ______  |\n"
                    "\t|                    |      | |\n"
                    "\t|                    |      | |\n"
                    "\t|                    |______| |\n"
                    "\t|_____________________________|\n\n";
        }
        else {
            cout << "\t _____________________________\n"
                    "\t|                     ______  |\n"
                    "\t|                    |      | |\n"
                    "\t|                    |      | |\n"
                    "\t|                    |______| |\n"
                    "\t|            ______           |\n"
                    "\t|           |      |          |  - 3\n"
                    "\t|           |      |          |\n"
                    "\t|  ______   |______|          |\n"
                    "\t| |      |                    |\n"
                    "\t| |      |                    |\n"
                    "\t| |______|                    |\n"
                    "\t|_____________________________|\n\n";
        }
    }
    else if(chel == 4) {
        cout << "\t _____________________________\n"
                "\t|  ______             ______  |\n"
                "\t| |      |           |      | |\n"
                "\t| |      |           |      | |\n"
                "\t| |______|           |______| |\n"
                "\t|                             |\n"
                "\t|                             |  - 4\n"
                "\t|                             |\n"
                "\t|  ______             ______  |\n"
                "\t| |      |           |      | |\n"
                "\t| |      |           |      | |\n"
                "\t| |______|           |______| |\n"
                "\t|_____________________________|\n\n";
    }
    else if(chel == 5) {
        cout << "\t _____________________________\n"
                "\t|  ______             ______  |\n"
                "\t| |      |           |      | |\n"
                "\t| |      |           |      | |\n"
                "\t| |______|           |______| |\n"
                "\t|            ______           |\n"
                "\t|           |      |          |  - 5\n"
                "\t|           |      |          |\n"
                "\t|  ______   |______|  ______  |\n"
                "\t| |      |           |      | |\n"
                "\t| |      |           |      | |\n"
                "\t| |______|           |______| |\n"
                "\t|_____________________________|\n\n";
    }
    else if(chel == 6) {
        if(ch == 0) {
            cout << "\t _____________________________\n"
                    "\t|  ____                 ____  |\n"
                    "\t| |    |               |    | |\n"
                    "\t| |____|               |____| |\n"
                    "\t|                             |\n"
                    "\t|  ____                 ____  |\n"
                    "\t| |    |               |    | |  - 6\n"
                    "\t| |____|               |____| |\n"
                    "\t|                             |\n"
                    "\t|  ____                 ____  |\n"
                    "\t| |    |               |    | |\n"
                    "\t| |____|               |____| |\n"
                    "\t|_____________________________|\n\n";
        }
        else {
            cout << "\t _____________________________\n"
                    "\t|  ____       ____      ____  |\n"
                    "\t| |    |     |    |    |    | |\n"
                    "\t| |____|     |____|    |____| |\n"
                    "\t|                             |\n"
                    "\t|                             |\n"
                    "\t|                             |  - 6\n"
                    "\t|                             |\n"
                    "\t|                             |\n"
                    "\t|  ____       ____      ____  |\n"
                    "\t| |    |     |    |    |    | |\n"
                    "\t| |____|     |____|    |____| |\n"
                    "\t|_____________________________|\n\n";
        }
    }
}


int user();
int PC();


int main()
{
    setlocale(LC_CTYPE, "rus");
    srand(time(NULL));

    int chal;

    cout << "Нажмите Enter чтобы начать игру" << endl;
    getchar();

    chal = rand() % 2;
    if(chal == 0)
    {
        cout << "Первым ходит - пользователь!\n" << endl;
        cout << "Нажмите Enter чтобы сделать ход" << endl;
        getchar();

        move();
        sum_user += chel;
        move();
        sum_user += chel;

        PC();
        cout << "Кол-во набранных промежуточных очков: " << sum_user << " - пользователем и "<< sum_PC << " - компьютером\n" << endl;

        for(int i = 0; i < 3; i++)
        {
            user();
            PC();
            cout << "Кол-во набранных промежуточных очков: " << sum_user << " - пользователем и "<< sum_PC << " - компьютером\n" << endl;
        }
    }
    else
    {
        cout << "Первым ходит - компьютер!\n" << endl;
        usleep(1000000);
        move();
        sum_PC += chel;
        move();
        sum_PC += chel;

        user();
        cout << "Кол-во набранных промежуточных очков: " << sum_PC << " - компьютером и "<< sum_user << " - пользователем\n" << endl;

        for(int i = 0; i < 3; i++)
        {
            PC();
            user();
            cout << "Кол-во набранных промежуточных очков: " << sum_PC << " - компьютером и "<< sum_user << " - пользователем\n" << endl;
        }
    }

    if(sum_user > sum_PC)
        cout << "Победил пользователь со счётом " << sum_user << " против " << sum_PC << "\n\n";
    if(sum_PC > sum_user)
        cout << "Победил компьютер со счётом " << sum_PC << " против " << sum_user << "\n\n";
    if(sum_PC == sum_user)
        cout << "Ничья!" << "\n\n";
}


int user()
{
    cout << "Ходит - пользователь!\n" << endl;
    cout << "Нажмите Enter чтобы сделать ход" << endl;
    cout.flush();
    getchar();

    move();
    sum_user += chel;
    move();
    sum_user += chel;

    return 0;
}


int PC()
{
    usleep(1000000);
    cout << "Ходит - компьютер!\n" << endl;
    move();
    sum_PC += chel;
    move();
    sum_PC += chel;

    return 0;
}

